Autodesk.Revit.ApplicationServices.Application.DocumentCreating
Subscribe to the DocumentCreating event to be notified when Revit is just about to create a new document.
Remarks:
This event is raised when Revit is just about to create a new document.
Event is cancellable. To cancel it, call the 'Cancel()' method of event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The document cannot be modified, for it is not created yet at the time of the event.
The following API functions are not available for the current document during this event:
Autodesk.Revit.ApplicationServices.Application.NewProjectDocument(System.String)Autodesk.Revit.ApplicationServices.Application.NewFamilyDocument(System.String)Autodesk.Revit.ApplicationServices.Application.NewProjectTemplateDocument(System.String)Autodesk.Revit.ApplicationServices.Application.OpenDocumentFile(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.DocumentCreated event will be raised immediately after document
creation is finished.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.FailuresProcessing
Subscribe to the FailuresProcessing event to be notified when failures are being processed at the end of transaction.
Remarks:
This event is raised when failures are being processed during transaction commit or rollback operations.
Handlers of this event have a limited ability to modify the document and/or failures in it, using provided
restricted failures accessor interface.
Since:
2011

Autodesk.Revit.ApplicationServices.Application.CopyModel(Autodesk.Revit.DB.ModelPath,System.String,System.Boolean)
Copies an existing model to a new file. Overwriting a file of the same name is allowed.
sourceModelPath:
The path of the file-based or server-based source model.
destFilePath:
The path of the destination file.
overwrite:
True if the destination file can be overwritten; otherwise, false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is being accessed by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory of destination file doesn't exist.
Throws Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException:
The destination file exists and can't be overwritten.
-or-
destFilePath is pointing to a folder that already exists and cannot be deleted.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The Revit model specified by sourceModelPath doesn't exist.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The destination file name includes one or more invalid characters.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2012

Autodesk.Revit.ApplicationServices.Application.SetLibraryPaths(System.Collections.Generic.IDictionary`2{System.String,System.String})
Sets path information identifying where Revit searches for content.
Remarks:
The map that
is returned should contain a key that is purpose of the path, such as Material Libraries and the value
in the map is the fully qualified path to be used for that search path.
paths:
The map of library paths.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.ApplicationServices.Application.CloudSharedLocalIncompatibleHandler
Subscribe to the CloudSharedLocalIncompatible event to be notified when cloud shared local being incompatible was detected.
Remarks:
This event is raised immediately after Revit has detected cloud shared local being incompatible.
It is raised even when cloud shared local being incompatible was detected.
Check the 'Operation' field in event's argument to see what the operation is when cloud shared local being incompatible was detected

Autodesk.Revit.ApplicationServices.Application.IsQuiescent
Returns if the current application is quiescent.
Remarks:  This property can be used check if the current application is quiescent. If
any document in the current application is in editing mode or an In-place family is being
edited, it returns false. Otherwise, true will be returned.

Autodesk.Revit.ApplicationServices.Application.ObjectFactory
Provides an object that can be used to create other instances of Autodesk Revit API
objects.
Remarks: Returns an object factory object that can create other objects. This property is available
for advanced use cases only. For general purpose creation of
Autodesk Revit API objects use the Application.Create object.